import hashlib
def egcd(aa, bb):
    if aa == 0:
        return (bb, 0, 1)
    else:
        g, x, y = egcd(bb % aa, aa)
        return (g, y - (bb // aa) * x, x)


def add(x2,y2):
    lam=((y2-y0) * egcd(x2-x0, p)[1])%p
    x3=(lam**2 - x0 - x2)%p
    y3 = (lam*(x0-x3)-y0)%p

    return x3,y3

p=57896044618658097711785492504343953926634992332820282019728792003956564821041
A=7
B=43308876546767276905765904595650931995942111794451039583252968842033849580414
x0=2
y0=4018974056539037503335449422937059775635739389905545080690979365213431566280

xQ=31899182243260933902044008430501676344396984055624158435194279595291700618179
yQ=20005589089071506881557653382514144854571261327412739507273322520426925799376
xR=20885010577555485361042080979202557410426270924314006348993769428415174131739
yR=25987426859962512235731681405357200809721519226318754593738741180094202697182

a,b=0,0
# first add
lam=( (3*x0**2+A) * egcd(2*y0,p)[1])%p
x2=(lam**2 -2 * x0)%p
y2 = (lam*(x0-x2)-y0)%p

# next add
X=x2
Y=y2
# find a
i=3
while (1):
    X,Y = add(X,Y)
    if X==xQ and Y==yQ:
        print('[+] a =',i)
        a=i
        break
    i+=1


X=x2
Y=y2
# find b
i=3
while (1):
    X,Y = add(X,Y)
    if X==xR and Y==yR:
        print('[+] b =',i)
        b=i
        break
    i+=1

# дальше проще всего воспользоваться сервисом http://www.christelbach.com/ECCalculator.aspx
# умножить точки и взять хеш
